import React from 'react';

const DescriptionAll = () => {
    return (
        <div className="description2">
            <h2>ОПИСАНИЕ СБОРКИ:</h2>

            <p>Сборка модов от MODZADROT это самая прокачанная геймплейная сборка для Скайрима из всех, которые только существуют и очень хардкорная. Моды для неё делали около 10-ти русскоязычных модмейкеров за последние два года. Она меняет только геймплей и не трогает никакой визуальной, графической и звуковой составляющей. Все это вы можете добавить уже самостоятельно по своему вкусу.
        Мы оказываем влияние только на геймплей. Чтобы играть в Скайрим было интересно, сложно и игра не надоедала вам уже через 10-20 часов, как это происходит в ванилле.</p>

            <p>Сборка имеет модульную структуру и позволяет вносить в себя изменения без возникновения проблем. Даже любой школьник сможет добавлять в сборку какие-то новые моды или отключать некоторые имеющиеся. Эту сборку можно очень гибко и удобно настраивать под себя.</p>

            <p>Для сборки нам нужны были некоторые моды, которых нельзя найти на Нексусе. Их просто не существовало. Поэтому, мы сделали их сами.</p>

            <p>Например, мод на хэдшоты и уменьшенный урон по рукам и ногам в дальнем бою для любителей стрельбы, который будет работать КОРРЕКТНО и позволять настраивать все множители урона. Попробуйте сами. Такого вы ещё не видели. Вы удивитесь как четко и корректно он работает.</p>

            <p>Нам наконец удалось пофиксить рефреш ассортимента всех торговцев! Когда вы бьете им по голове и перезагружаетесь их товары не обновляются. Теперь вы не можете это абузить. (mr. Cat’у не понравится).</p>

            <p>Мы написали мод на сон (усталость), который будет накладывать на вашего персонажа дебафы тем сильнее, чем дольше вы не спите. И этот мод создан не потому что мы просто хотели заставить игрока спать и сделать таверны небесполезными, а потому, что этот мод фиксит абуз ожидания (“тэшка” как говорит SilverName на своих стримах по Скайриму). Теперь вы не можете бесконечно использовать ожидание, чтобы восстанавливать свой запас сил, здоровья или магии “забесплатно”.
            Мы создали огромнейшую систему поклонения богам и служения даэдра, которая повышает ценность и значимость в игре Аэдра и Даэдра. Мы ввели систему кармы, испортив которую преступлениями вы не сможете поклоняться Аэдра и получать от них бонусы и бафы.
        Карма фиксит воровство и убийства, благодаря которым можно уже в начале игры получать огромные количества золота без особых проблем. Это очень большая тема, посмотрите обзорные видео, чтобы узнать больше.</p>

            <p>В нашей сборке вы не сможете прокачаться быстро каким либо образом и получить себе много ресурсов в начале игры. Это просто невозможно. Нужно последовательно, постепенно проходить все квесты и качаться на противниках чтобы становиться сильнее и сильнее. Только так можно одолеть самых опасных врагов.</p>

            <p>Мы создали практически новую систему прокачки игрока и изменили все перки для некоторых боевых навыков, чтобы сбалансировать, улучшить и разнообразить вариативность прохождения игры.</p>

            <p>А то, что мы сделали с магией - святые злокрысы! Начинать играть за мага ещё никогда не было так сложно! Вы будете плакать. Но в лэйте вы все равно сможете стать машиной для убийства! Вот только лэйтовые противники тоже не слабы.</p>

            <p>Сборка основана на глобальном моде Реквием и изменяет его очень сильно, потому что ванильный Реквием это очень несбалансированная, легкая и абузная штука.</p>

            <p>Изменений настолько много, что если рассказывать обо всем, это займет несколько часов. Поэтому в описании здесь это сделать невозможно. Мы записали несколько видео, в которых рассказывается о самом главном и мы составили описание сборки с кучей разных таблиц, в которых можно узнать чуть ли не об абсолютно каждом изменении в игре.</p>

            <p>Перед нами стояла задача сделать самую хардкорную сборку без единого абуза игровых механик и абуза прокачки навыков. При этом ПОЛНОСТЬЮ сохранив атмосферу игры и классическую систему прочачки (используешь навык - прокачиваешь навык).</p>

            <p><a href="https://clck.ru/HaGHK">Полное описание сборки</a></p>
        </div>
    );
}

export default DescriptionAll;
